<?php

namespace Apps\Services\Scorings\Library;

if (!defined('ROOT')) {
    exit();
}

/**
 * Класс OKWCurrencyCodes
 * @version 0.0.1
 * @package Apps\Services\Scorings\Library\OKWCurrencyCodes
 * @generated Зорин Алексей, please DO NOT EDIT!
 * @author Зорин Алексей <zorinalexey59292@gmail.com>
 * @copyright 2022 разработчик Зорин Алексей Евгеньевич.
 */
class OKWCurrencyCodes
{

    use Books;

    /**
     * Коллекция возможных значений
     * @var array
     */
    public static array $data = [
        'Лек' => [
            'code' => 'ALL',
            'countries' => [
                'Албания'
            ]
        ],
        'Алжирский динар' => [
            'code' => 'DZD',
            'countries' => [
                'Алжир'
            ]
        ],
        'Аргентинское песо' => [
            'code' => 'ARS',
            'countries' => [
                'Аргентина'
            ]
        ],
        'Австралийский доллар' => [
            'code' => 'AUD',
            'countries' => [
                'Австралия',
                'Кирибати',
                'Кокосовые (Килинг) острова',
                'Килинг',
                'Кокосовые острова',
                'Науру',
                'Остров Норфолк',
                'Остров Рождества',
                'Остров Херд и острова Макдональд',
                'Остров Херд',
                'Острова Макдональд',
                'Тувалу'
            ]
        ],
        'Багамский доллар' => [
            'code' => 'BSD',
            'countries' => [
                'Багамы'
            ]
        ],
        'Бахрейнский динар' => [
            'code' => 'BHD',
            'countries' => [
                'Бахрейн'
            ]
        ],
        'Така' => [
            'code' => 'BDT',
            'countries' => [
                'Бангладеш'
            ]
        ],
        'Армянский драм' => [
            'code' => 'AMD',
            'countries' => [
                'Армения'
            ]
        ],
        '' => [
            'code' => '',
            'countries' => [
                ''
            ]
        ],
        'Барбадосский доллар' => [
            'code' => 'BBD',
            'countries' => [
                'Барбадос'
            ]
        ],
        'Бермудский доллар' => [
            'code' => 'BMD',
            'countries' => [
                'Бермуды'
            ]
        ],
        'Нгултрум' => [
            'code' => 'BTN',
            'countries' => [
                'Бутан'
            ]
        ],
        'Боливиано' => [
            'code' => 'BOB',
            'countries' => [
                'Боливия'
            ]
        ],
        'Пула' => [
            'code' => 'BWP',
            'countries' => [
                'Ботсвана'
            ]
        ],
        'Белизский доллар' => [
            'code' => 'BZD',
            'countries' => [
                'Белиз'
            ]
        ],
        'Доллар Соломоновых Островов' => [
            'code' => 'SBD',
            'countries' => [
                'Соломоновы Острова'
            ]
        ],
        'Брунейский доллар' => [
            'code' => 'BND',
            'countries' => [
                'Бруней-Даруссалам'
            ]
        ],
        'Кьят' => [
            'code' => 'MMK',
            'countries' => [
                'Мьянма'
            ]
        ],
        'Бурундийский франк' => [
            'code' => 'BIF',
            'countries' => [
                'Бурунди'
            ]
        ],
        'Риель' => [
            'code' => 'KHR',
            'countries' => [
                'Камбоджа'
            ]
        ],
        'Канадский доллар' => [
            'code' => 'CAD',
            'countries' => [
                'Канада'
            ]
        ],
        'Эскудо Кабо-Верде' => [
            'code' => 'CVE',
            'countries' => [
                'Кабо-Верде'
            ]
        ],
        'Доллар Островов Кайман' => [
            'code' => 'KYD',
            'countries' => [
                'Доллар Островов Кайман'
            ]
        ],
        'Шри-ланкийская рупия' => [
            'code' => 'LKR',
            'countries' => [
                'Шри-Ланка'
            ]
        ],
        'Чилийское песо' => [
            'code' => 'CLP',
            'countries' => [
                'Чили'
            ]
        ],
        'Юань' => [
            'code' => 'CNY',
            'countries' => [
                'Китай'
            ]
        ],
        'Колумбийское песо' => [
            'code' => 'COP',
            'countries' => [
                'Колумбия'
            ]
        ],
        'Коморский франк' => [
            'code' => 'KMF',
            'countries' => [
                'Коморы'
            ]
        ],
        'Коста-риканский колон' => [
            'code' => 'CRC',
            'countries' => [
                'Коста-Рика'
            ]
        ],
        'Куна' => [
            'code' => 'HRK',
            'countries' => [
                'Хорватия'
            ]
        ],
        'Кубинское песо' => [
            'code' => 'CUP',
            'countries' => [
                'Куба'
            ]
        ],
        'Чешская крона' => [
            'code' => 'CZK',
            'countries' => [
                'Чехия'
            ]
        ],
        'Датская крона' => [
            'code' => 'DKK',
            'countries' => [
                'Гренландия',
                'Дания',
                'Фарерские острова'
            ]
        ],
        'Доминиканское песо' => [
            'code' => 'DOP',
            'countries' => [
                'Доминиканская Республика'
            ]
        ],
        'Сальвадорский колон' => [
            'code' => 'SVC',
            'countries' => [
                'Эль-Сальвадор'
            ]
        ],
        'Эфиопский быр' => [
            'code' => 'ETB',
            'countries' => [
                'Эфиопия'
            ]
        ],
        'Накфа' => [
            'code' => 'ERN',
            'countries' => [
                'Эритрея'
            ]
        ],
        'Фунт Фолклендских островов' => [
            'code' => 'FKP',
            'countries' => [
                'Фолклендские острова (Мальвинские)',
                'Фолклендские острова',
                'Мальвинские острова'
            ]
        ],
        'Доллар Фиджи' => [
            'code' => 'FJD',
            'countries' => [
                'Фиджи'
            ]
        ],
        'Франк Джибути' => [
            'code' => 'DJF',
            'countries' => [
                'Джибути'
            ]
        ],
        'Даласи' => [
            'code' => 'GMD',
            'countries' => [
                'Гамбия'
            ]
        ],
        'Гибралтарский фунт' => [
            'code' => 'GIP',
            'countries' => [
                'Гибралтар'
            ]
        ],
        'Кетсаль' => [
            'code' => 'GTQ',
            'countries' => [
                'Гватемала'
            ]
        ],
        'Гвинейский франк' => [
            'code' => 'GNF',
            'countries' => [
                'Гвинея'
            ]
        ],
        'Гайанский доллар' => [
            'code' => 'GYD',
            'countries' => [
                'Гайана'
            ]
        ],
        'Гурд' => [
            'code' => 'HTG',
            'countries' => [
                'Гаити'
            ]
        ],
        'Лемпира' => [
            'code' => 'HNL',
            'countries' => [
                'Гондурас'
            ]
        ],
        'Гонконгский доллар' => [
            'code' => 'HKD',
            'countries' => [
                'Гонконг'
            ]
        ],
        'Форинт' => [
            'code' => 'HUF',
            'countries' => [
                'Венгрия'
            ]
        ],
        'Исландская крона' => [
            'code' => 'ISK',
            'countries' => [
                'Исландия'
            ]
        ],
        'Индийская рупия' => [
            'code' => 'INR',
            'countries' => [
                'Бутан',
                'Индия'
            ]
        ],
        'Рупия' => [
            'code' => 'IDR',
            'countries' => [
                'Индонезия'
            ]
        ],
        'Иранский риал' => [
            'code' => 'IRR',
            'countries' => [
                'Иран (Исламская Республика)',
                'Иран'
            ]
        ],
        'Иракский динар' => [
            'code' => 'IQD',
            'countries' => [
                'Ирак'
            ]
        ],
        'Новый израильский шекель' => [
            'code' => 'ILS',
            'countries' => [
                'Израиль'
            ]
        ],
        'Ямайский доллар' => [
            'code' => 'JMD',
            'countries' => [
                'Ямайка'
            ]
        ],
        'Иена' => [
            'code' => 'JPY',
            'countries' => [
                'Япония'
            ]
        ],
        'Тенге' => [
            'code' => 'KZT',
            'countries' => [
                'Казахстан'
            ]
        ],
        'Иорданский динар' => [
            'code' => 'JOD',
            'countries' => [
                'Иордания'
            ]
        ],
        'Кенийский шиллинг' => [
            'code' => 'KES',
            'countries' => [
                'Кения'
            ]
        ],
        'Северокорейская вона' => [
            'code' => 'KPW',
            'countries' => [
                'Корея, народно-демократическая республика',
                'Северная Корея'
            ]
        ],
        'Вона' => [
            'code' => 'KRW',
            'countries' => [
                'Корея, республика'
            ]
        ],
        'Кувейтский динар' => [
            'code' => 'KWD',
            'countries' => [
                'Кувейт'
            ]
        ],
        'Сом' => [
            'code' => 'KGS',
            'countries' => [
                'Киргизия'
            ]
        ],
        'Лаосский кип' => [
            'code' => 'LAK',
            'countries' => [
                'Лаосская Народно-Демократическая Республика'
            ]
        ],
        'Ливанский фунт' => [
            'code' => 'LBP',
            'countries' => [
                'Ливан'
            ]
        ],
        'Лоти' => [
            'code' => 'LSL',
            'countries' => [
                'Лесото'
            ]
        ],
        'Либерийский доллар' => [
            'code' => 'LRD',
            'countries' => [
                'Либерия'
            ]
        ],
        'Ливийский динар' => [
            'code' => 'LYD',
            'countries' => [
                'Ливия'
            ]
        ],
        'Патака' => [
            'code' => 'MOP',
            'countries' => [
                'Макао'
            ]
        ],
        'Малавийская квача' => [
            'code' => 'MWK',
            'countries' => [
                'Малави'
            ]
        ],
        'Малайзийский ринггит' => [
            'code' => 'MYR',
            'countries' => [
                'Малайзия'
            ]
        ],
        'Руфия' => [
            'code' => 'MVR',
            'countries' => [
                'Мальдивы'
            ]
        ],
        'Маврикийская рупия' => [
            'code' => 'MUR',
            'countries' => [
                'Маврикий'
            ]
        ],
        'Мексиканское песо' => [
            'code' => 'MXN',
            'countries' => [
                'Мексика'
            ]
        ],
        'Тугрик' => [
            'code' => 'MNT',
            'countries' => [
                'Монголия'
            ]
        ],
        'Молдавский лей' => [
            'code' => 'MDL',
            'countries' => [
                'Молдова, республика',
                'Молдова',
                'Республика Молдова'
            ]
        ],
        'Марокканский дирхам' => [
            'code' => 'MAD',
            'countries' => [
                'Западная Сахара',
                'Марокко'
            ]
        ],
        'Оманский риал' => [
            'code' => 'OMR',
            'countries' => [
                'Оман'
            ]
        ],
        'Доллар Намибии' => [
            'code' => 'NAD',
            'countries' => [
                'Намибия'
            ]
        ],
        'Непальская рупия' => [
            'code' => 'NPR',
            'countries' => [
                'Непал'
            ]
        ],
        'Нидерландский антильский гульден' => [
            'code' => 'ANG',
            'countries' => [
                'Кюрасао',
                'Сен-Мартен (нидерландская часть)'
            ]
        ],
        'Золотая кордоба' => [
            'code' => 'NIO',
            'countries' => [
                'Никарагуа'
            ]
        ],
        'Найра' => [
            'code' => 'NGN',
            'countries' => [
                'Нигерия'
            ]
        ],
        'Норвежская крона' => [
            'code' => 'NOK',
            'countries' => [
                'Норвегия',
                'Остров Буве',
                'Шпицберген и Ян Майен',
                'Шпицберген',
                'Ян Майен'
            ]
        ],
        'Пакистанская рупия' => [
            'code' => 'PKR',
            'countries' => [
                'Пакистан'
            ]
        ],
        'Бальбоа' => [
            'code' => 'PAB',
            'countries' => [
                'Панама'
            ]
        ],
        'Кина' => [
            'code' => 'PGK',
            'countries' => [
                'Папуа Новая Гвинея',
                'Папуа',
                'Новая Гвинея'
            ]
        ],
        'Гуарани' => [
            'code' => 'PYG',
            'countries' => [
                'Парагвай'
            ]
        ],
        'Соль' => [
            'code' => 'PEN',
            'countries' => [
                'Перу'
            ]
        ],
        'Филиппинское песо' => [
            'code' => 'PHP',
            'countries' => [
                'Филиппины'
            ]
        ],
        'Катарский риал' => [
            'code' => 'QAR',
            'countries' => [
                'Катар'
            ]
        ],
        'Российский рубль' => [
            'code' => 'RUB',
            'countries' => [
                'Россия',
                'Российская Федерация'
            ]
        ],
        'Франк Руанды' => [
            'code' => 'RWF',
            'countries' => [
                'Руанда'
            ]
        ],
        'Фунт Святой Елены' => [
            'code' => 'SHP',
            'countries' => [
                'Святая Елена',
                'остров Вознесения',
                'Тристан-да-Кунья'
            ]
        ],
        'Саудовский риял' => [
            'code' => 'SAR',
            'countries' => [
                'Саудовская Аравия'
            ]
        ],
        'Сейшельская рупия' => [
            'code' => 'SCR',
            'countries' => [
                'Сейшелы'
            ]
        ],
        'Леоне' => [
            'code' => 'SLL',
            'countries' => [
                'Сьерра-Леоне'
            ]
        ],
        'Сингапурский доллар' => [
            'code' => 'SGD',
            'countries' => [
                'Сингапур'
            ]
        ],
        'Донг' => [
            'code' => 'VND',
            'countries' => [
                'Вьетнам'
            ]
        ],
        'Сомалийский шиллинг' => [
            'code' => 'SOS',
            'countries' => [
                'Сомали'
            ]
        ],
        'Рэнд' => [
            'code' => 'ZAR',
            'countries' => [
                'Лесото',
                'Намибия',
                'Южная Африка'
            ]
        ],
        'Южносуданский фунт' => [
            'code' => 'SSP',
            'countries' => [
                'Южный Судан'
            ]
        ],
        'Лилангени' => [
            'code' => 'SZL',
            'countries' => [
                'Эсватини'
            ]
        ],
        'Шведская крона' => [
            'code' => 'SEK',
            'countries' => [
                'Швеция'
            ]
        ],
        'Швейцарский франк' => [
            'code' => 'CHF',
            'countries' => [
                'Лихтенштейн',
                'Швейцария'
            ]
        ],
        'Сирийский фунт' => [
            'code' => 'SYP',
            'countries' => [
                'Сирийская Арабская Республика',
                'Сирия',
            ]
        ],
        'Бат' => [
            'code' => 'THB',
            'countries' => [
                'Таиланд'
            ]
        ],
        'Паанга' => [
            'code' => 'TOP',
            'countries' => [
                'Тонга'
            ]
        ],
        'Доллар Тринидада и Тобаго' => [
            'code' => 'TTD',
            'countries' => [
                'Тринидад и Тобаго',
                'Тобаго',
                'Тринидад'
            ]
        ],
        'Дирхам (ОАЭ)' => [
            'code' => 'AED',
            'countries' => [
                'Объединенные Арабские Эмираты (ОАЭ)',
                'ОАЭ'
            ]
        ],
        'Тунисский динар' => [
            'code' => 'TND',
            'countries' => [
                'Тунис'
            ]
        ],
        'Угандийский шиллинг' => [
            'code' => 'UGX',
            'countries' => [
                'Уганда'
            ]
        ],
        'Денар' => [
            'code' => 'MKD',
            'countries' => [
                'Македония, бывшая Югославская Республика',
                'бывшая Югославская Республика',
                'Македония'
            ]
        ],
        'Египетский фунт' => [
            'code' => 'EGP',
            'countries' => [
                'Египет'
            ]
        ],
        'Фунт стерлингов' => [
            'code' => 'GBP',
            'countries' => [
                'Соединенное королевство'
            ]
        ],
        'Танзанийский шиллинг' => [
            'code' => 'TZS',
            'countries' => [
                'Танзания, объединенная республика',
                'Танзания',
            ]
        ],
        'Доллар США' => [
            'code' => 'USD',
            'countries' => [
                'Американское Самоа',
                'Британская территория в Индийском океане',
                'Бонэйр',
                'Синт-Эстатиус',
                'Саба',
                'Виргинские острова (Британские)',
                'Виргинские острова (США)',
                'Гаити',
                'Гуам',
                'Малые Тихоокеанские Отдаленные острова Соединенных Штатов',
                'Маршалловы Острова',
                'Микронезия, федеративные штаты',
                'Острова Теркс и Кайкос',
                'Палау',
                'Панама',
                'Пуэрто-Рико',
                'Северные Марианские острова',
                'Соединенные Штаты',
                'Тимор-Лесте',
                'Эквадор',
                'Эль-Сальвадор'
            ]
        ],
        'Уругвайское песо' => [
            'code' => 'UYU',
            'countries' => [
                'Уругвай'
            ]
        ],
        'Узбекский сум' => [
            'code' => '',
            'countries' => [
                'Узбекистан'
            ]
        ],
        'Тала' => [
            'code' => 'WST',
            'countries' => [
                'Самоа'
            ]
        ],
        'Йеменский риал' => [
            'code' => 'YER',
            'countries' => [
                'Йемен'
            ]
        ],
        'Новый тайваньский доллар' => [
            'code' => 'TWD',
            'countries' => [
                'Тайвань (Китай)',
                'Тайвань'
            ]
        ],
        'Боливар Соберано' => [
            'code' => 'VES',
            'countries' => [
                'Венесуэла (Боливарианская Республика)',
                'Боливарианская Республика'
            ]
        ],
        'Угия' => [
            'code' => 'MRU',
            'countries' => [
                'Мавритания'
            ]
        ],
        'Добра' => [
            'code' => 'STN',
            'countries' => [
                'Сан-Томе и Принсипи',
                'Принсипи',
                'Сан-Томе'
            ]
        ],
        'Конвертируемое песо' => [
            'code' => 'CUC',
            'countries' => [
                'Куба'
            ]
        ],
        'Доллар Зимбабве' => [
            'code' => 'ZWL',
            'countries' => [
                'Зимбабве'
            ]
        ],
        'Белорусский рубль' => [
            'code' => 'BYN',
            'countries' => [
                'Беларусь'
            ]
        ],
        'Новый туркменский манат' => [
            'code' => 'TMT',
            'countries' => [
                'Туркменистан'
            ]
        ],
        'Ганский седи' => [
            'code' => 'GHS',
            'countries' => [
                'Гана'
            ]
        ],
        'Суданский фунт' => [
            'code' => 'SDG',
            'countries' => [
                'Судан'
            ]
        ],
        'Уругвайское песо в индексированных единицах' => [
            'code' => 'UYI',
            'countries' => [
                'Уругвай'
            ]
        ],
        'Сербский динар' => [
            'code' => 'RSD',
            'countries' => [
                'Сербия'
            ]
        ],
        'Мозамбикский метикал' => [
            'code' => 'MZN',
            'countries' => [
                'Мозамбик'
            ]
        ],
        'Азербайджанский манат' => [
            'code' => 'AZN',
            'countries' => [
                'Азербайджан'
            ]
        ],
        'Румынский лей' => [
            'code' => 'RON',
            'countries' => [
                'Румыния'
            ]
        ],
        'Турецкая лира' => [
            'code' => 'TRY',
            'countries' => [
                'Турция'
            ]
        ],
        'Франк КФА ВЕАС' => [
            'code' => 'XAF',
            'countries' => [
                'Габон',
                'Камерун',
                'Конго',
                'Центрально-Африканская Республика',
                'Чад',
                'Экваториальная Гвинея'
            ],
            'explanation' => 'Франк КФА ВЕАС - денежная единица Банка государств Центральной Африки'
        ],
        'Восточно-карибский доллар' => [
            'code' => 'XCD',
            'countries' => [
                'Ангилья',
                'Антигуа', 'Барбуда',
                'Гренада', 'Доминика',
                'Монтсеррат',
                'Сент-Винсент', 'Гренадины',
                'Сент-Китс', 'Невис',
                'Сент-Люсия'
            ]
        ],
        'Франк КФА ВСЕАО' => [
            'code' => 'XOF',
            'countries' => [
                'Бенин',
                'Буркина-Фасо',
                'Гвинея-Бисау',
                'Кот д`Ивуар',
                'Мали',
                'Нигер',
                'Сенегал',
                'Того'
            ],
            'explanation' => 'Франк КФА ВСЕАО - денежная единица Центрального Банка государств Западной Африки'
        ],
        'Франк КФП' => [
            'code' => 'XPF',
            'countries' => [
                'Новая Каледония',
                'Французская Полинезия',
                'Уоллис',
                'Футуна'
            ]
        ],
        'СДР (специальные права заимствования)' => [
            'code' => 'XDR',
            'countries' => [
                'Международный валютный фонд (МВФ)',
                'Международный валютный фонд',
                'МВФ',
            ]
        ],
        'Замбийская квача' => [
            'code' => 'ZMW',
            'countries' => [
                'Замбия'
            ]
        ],
        'Суринамский доллар' => [
            'code' => 'SRD',
            'countries' => [
                'Суринам'
            ]
        ],
        'Единица реальной стоимости' => [
            'code' => 'COU',
            'countries' => [
                'Колумбия'
            ]
        ],
        'Афгани' => [
            'code' => 'AFN',
            'countries' => [
                'Афганистан'
            ]
        ],
        'Сомони' => [
            'code' => 'TJS',
            'countries' => [
                'Таджикистан'
            ]
        ],
        'Кванза' => [
            'code' => 'AOA',
            'countries' => [
                'Ангола'
            ]
        ],
        'Болгарский лев' => [
            'code' => 'BGN',
            'countries' => [
                'Болгария'
            ]
        ],
        'Конголезский франк' => [
            'code' => 'CDF',
            'countries' => [
                'Конго, демократическая республика',
                'Конго',
            ]
        ],
        'Конвертируемая марка' => [
            'code' => 'BAM',
            'countries' => [
                'Босния и Герцеговина',
                'Босния',
                'Герцеговина',
            ]
        ],
        'Евро' => [
            'code' => 'EUR',
            'countries' => [
                'Австрия',
                'Андорра',
                'Бельгия',
                'Гваделупа',
                'Германия',
                'Греция',
                'Ирландия',
                'Испания',
                'Италия',
                'Кипр',
                'Латвия',
                'Литва',
                'Люксембург',
                'Майотта',
                'Мальта',
                'Мартиника',
                'Монако',
                'Нидерланды',
                'Папский Престол (Государство-город Ватикан)',
                'Ватикан',
                'Папский Престол',
                'Португалия',
                'Реюньон',
                'Сан-Марино',
                'Сен-Бартелеми',
                'Сен-Мартен (французская часть)',
                'Сент-Пьер',
                'Микелон',
                'Словакия',
                'Словения',
                'Финляндия',
                'Франция',
                'Французская Гвиана',
                'Французские Южные территории',
                'Черногория',
                'Эландские острова',
                'Эстония'
            ]
        ],
        'Гривна' => [
            'code' => 'UAH',
            'countries' => [
                'Украина'
            ]
        ],
        'Лари' => [
            'code' => 'GEL',
            'countries' => [
                'Грузия'
            ]
        ],
        'Злотый' => [
            'code' => 'PLN',
            'countries' => [
                'Польша'
            ]
        ],
        'Бразильский реал' => [
            'code' => 'BRL',
            'countries' => [
                'Бразилия'
            ]
        ]
    ];
    /**
     * Значение словаря по умолчанию
     * @var string
     */
    private static string $default = 'RUB';

    public static function get($value)
    {
        $getValue = mb_strtolower($value);
        $obj = new self();
        foreach (self::$data as $name => $info) {
            if ($getValue === mb_strtolower($name) or $getValue === mb_strtolower($info['code'])) {
                $obj->name = $name;
                $obj->code = $info['code'];
                return $obj;
            } else {
                foreach ($info['countries'] as $country) {
                    if ($getValue === mb_strtolower($country)) {
                        $obj->name = $name;
                        $obj->code = $info['code'];
                        return $obj;
                    }
                }
            }
        }
        if (!$obj->code and !$obj->name) {
            return self::get(self::$default);
        }
    }

}
